In [1]:
import pandas as pd
import os
import matplotlib.pyplot as plt
import numpy as np

# Prepare data for interactive plot
In this notebook, three csv files are generated for the website interactive plot.
- **movie_impact.csv** : contains the movies to add as scatter points on the baby_name curve for positive, negative and insignificant variations. <br>
        Columns: `['name', 'status', 'group_year', 'movie_id']` <br>
        `'status'` contains either `'t'`, `'b'`, `'i'` for positive, negative and insignificant variation respectively <br>
        `'group_year'` correspond to the year where the movie must be displayed

- **name_per_year.csv** : contains the baby names data for each name and year. The data is in fraction of the total newborns of the year (in percent).<br>
Columns: `['name', 'year', 'percentage']`

- **movies.csv** : contains the movie informations and objects needed to construct the links to the poster and the IMDB wesite. <br>
Columns: `['movie_id', 'mov_name', 'year', 'vote', 'rating', 'poster_url' 'imdb_id]`

All of them are simplified version of the dataframe computed in [preprocessing.ipynb](./preprocessing.ipynb), in order to simplify the plot generation on the website and to avoid slowing down the website with too much data.

In [2]:
folder_processed_data_path = './processed_data/'
processed_website_data_folder = './processed_data/website/'

We import the dataframe computed in preprocessing.

In [3]:
# import the name by movie
name_by_movie_df = pd.read_csv(os.path.join(folder_processed_data_path, 'name_by_movie_ordered_pvalue_10_5_df.csv'))
name_by_movie_df.set_index(['wiki_ID', 'char_words', 'gender'], inplace=True)
display(name_by_movie_df.sample(2))

# import the movie dataframe
movie_df = pd.read_csv(os.path.join(folder_processed_data_path, 'movie_df.csv'))
movie_df.set_index(['wiki_ID'], inplace=True)
display(movie_df.sample(2))

# import the name_by_movie dataframe
baby_name_df = pd.read_csv(os.path.join(folder_processed_data_path, 'baby_name_df.csv'))
baby_name_df.set_index(['name', 'year'], inplace=True)
display(baby_name_df.sample(2))

                           order    t_stat   p_value  slope_change
wiki_ID char_words gender
408849  Duncan     M         5.0  1.697146  0.117747     -0.001721
99123   Baby       F        25.0  3.127730  0.009616     -0.002867

,mov_name,year,month,revenue,numVotes,averageRating,poster_url,IMDB_ID
wiki_ID,,,,,,,,
3150333,Baby Bottleneck,1946,NaN,NaN,935,7.1,/cQA6hToekWXrHiN5qGU3vRahzgf.jpg,tt0038317
32736970,Porky in Egypt,1938,11.0,NaN,452,6.2,NaN,tt0030603

               number  percentage
name     year
Jeniffer 1969      31    0.000905
Kiet     1984       7    0.000205

## Compute `movie_impact` dataframe

The dataframe `movie_impact` is a subset of the dataframe `name_by_movie` computed in [preprocessing.ipynb](./preprocessing.ipynb).

### Filtering of `name_by_movie`  : importance of the role

Lets remove the character names with an minor role in the movie. We will keep only the characters with an order higher or equal to the median of the set of order in the movie. First, let's compute the number of order for each movies and merge it the `name_by_movie` dataframe.

In [4]:
# compute the order count of each movie
name_by_movie_groupby_id = name_by_movie_df.groupby(['wiki_ID'])
order_counts = name_by_movie_groupby_id['order'].count()

# convert from serie to dataframe and rename the columns
order_counts_df = order_counts.to_frame()
order_counts_df.rename(columns={"order": "nb_order"}, inplace=True)
display(order_counts_df.head())

         nb_order
wiki_ID
3217           11
3746           15
3837           18
3947           16
4227            2

In [5]:
# merge the order count with name_by_movie_df
name_by_movie_order_counts = name_by_movie_df.reset_index().merge(order_counts_df, on='wiki_ID', how='left')
display(name_by_movie_order_counts.sample(2))

,wiki_ID,char_words,gender,order,t_stat,p_value,slope_change,nb_order
142413,24449669,Mark,M,4.0,-2.940694,0.013431,0.007136,10
57095,3640544,Wentworth,M,1.0,NaN,NaN,0.000000,15

In [6]:
# check a special case with tommy character in Titanic (1997) (wiki_ID = 52371) (toy_story_1995_ID = 53085)
display(name_by_movie_order_counts[name_by_movie_order_counts['wiki_ID'] == 52371])
len(name_by_movie_order_counts)

,wiki_ID,char_words,gender,order,t_stat,p_value,slope_change,nb_order
1891,52371,Caledon,M,NaN,NaN,NaN,0.000000,28
1892,52371,Dewitt,F,NaN,-0.414992,0.686126,0.000059,28
1893,52371,Rose,F,1.0,-1.552929,0.148720,0.002796,28
1894,52371,De,M,NaN,0.785788,0.448587,-0.000182,28
1895,52371,Jack,M,0.0,-1.987322,0.072358,0.012744,28
1896,52371,Charles,M,NaN,-3.093865,0.010215,0.008629,28
1897,52371,Bruce,M,10.0,-2.545008,0.027236,0.001570,28
1898,52371,Calvert,F,12.0,0.216687,0.832419,-0.000017,28
1899,52371,Ismay,M,10.0,NaN,NaN,0.000000,28
1900,52371,Brown,F,3.0,0.000000,1.000000,0.000000,28
1901,52371,Bobby,M,13.0,-1.158331,0.271259,0.001117,28
1902,52371,Archibald,M,19.0,0.179745,0.860621,-0.000009,28
1903,52371,Lowe,M,20.0,NaN,NaN,0.000000,28
1904,52371,John,M,17.0,-0.499025,0.627591,0.002662,28
1905,52371,Fabrizio,M,14.0,-0.994141,0.341520,0.000071,28
1906,52371,Murdoch,M,18.0,NaN,NaN,0.000000,28
1907,52371,Lizzy,F,12.0,-3.342963,0.006559,0.000100,28
1908,52371,Harold,M,34.0,-1.071750,0.306783,0.000497,28
1909,52371,Andrews,M,6.0,-0.561223,0.585897,0.000045,28
1910,52371,Smith,M,8.0,-0.612611,0.552587,0.000066,28
1911,52371,Thomas,M,6.0,-0.782808,0.450264,0.006375,28
1912,52371,Ruth,F,4.0,-1.262820,0.232767,0.001224,28
1913,52371,Dawson,M,0.0,-1.330585,0.210250,0.012189,28
1914,52371,William,M,NaN,-1.268811,0.230700,0.008822,28
1915,52371,Captain,M,NaN,NaN,NaN,0.000000,28
1916,52371,Astor,M,17.0,NaN,NaN,0.000000,28
1917,52371,Rossi,M,NaN,0.000000,1.000000,0.000000,28
1918,52371,Gracie,M,19.0,-6.622880,0.000037,0.011361,28
1919,52371,Lovett,M,7.0,NaN,NaN,0.000000,28
1920,52371,Molly,F,3.0,0.375483,0.714441,-0.002190,28
1921,52371,Lewis,M,11.0,-0.271231,0.791236,0.000181,28
1922,52371,Buell,M,13.0,NaN,NaN,0.000000,28
1923,52371,Jacob,M,NaN,3.886102,0.002537,-0.072817,28
1924,52371,Tommy,M,15.0,1.248063,0.237921,-0.000858,28
1925,52371,Brock,M,7.0,-0.215546,0.833286,0.000392,28
1926,52371,Ryan,M,15.0,-0.239643,0.815014,0.003500,28

172906

In [7]:
# add a boolean attribute to check if all the order are nan
all_nan_mask = name_by_movie_order_counts.groupby('wiki_ID')['order'].transform(lambda x: x.isna().all())
name_by_movie_order_counts['all_nan'] = all_nan_mask
display(name_by_movie_order_counts)
display(name_by_movie_order_counts[name_by_movie_order_counts['wiki_ID'] == 53085])

,wiki_ID,char_words,gender,order,t_stat,p_value,slope_change,nb_order,all_nan
0,3217,Gold,NaN,6.0,NaN,NaN,0.000000,11,False
1,3217,Linda,F,7.0,-0.416786,0.684853,0.000673,11,False
2,3217,Henry,M,4.0,-2.031668,0.067058,0.002513,11,False
3,3217,Duke,M,4.0,0.579441,0.573967,-0.000113,11,False
4,3217,Warrior,M,9.0,NaN,NaN,0.000000,11,False
...,...,...,...,...,...,...,...,...,...
172901,37478048,Ajay,M,9.0,-0.819213,0.430057,0.000130,1,False
172902,37501922,Murphy,F,3.0,1.264175,0.232298,-0.000365,4,False
172903,37501922,Hunter,M,1.0,-7.083089,0.000020,0.036603,4,False
172904,37501922,John,M,1.0,-2.172964,0.052505,0.012557,4,False
172905,37501922,Craig,F,3.0,-0.200536,0.844721,0.000666,4,False

,wiki_ID,char_words,gender,order,t_stat,p_value,slope_change,nb_order,all_nan
1998,53085,Sheriff,M,NaN,0.229327,0.822823,-0.000007,0,True
1999,53085,Hannah,F,NaN,0.425090,0.678968,-0.004957,0,True
2000,53085,Sid,M,NaN,-0.191613,0.851537,0.000011,0,True
2001,53085,Woody,M,NaN,-0.070205,0.945291,0.000007,0,True
2002,53085,Rex,M,NaN,-0.685448,0.507250,0.000164,0,True
2003,53085,Buzz,M,NaN,0.000000,1.000000,0.000000,0,True
2004,53085,Bo,F,NaN,0.064099,0.950041,-0.000032,0,True
2005,53085,Andy,M,NaN,-1.964199,0.075273,0.002058,0,True

In [8]:
# filter to keep only half of the characters with the lowest order, or keep all of them if all the order of the movie are NaN
name_by_movie_merged_important_role = name_by_movie_order_counts[name_by_movie_order_counts['all_nan'] | (name_by_movie_order_counts['order'] <= (name_by_movie_order_counts['nb_order']/2))].copy(deep=True)
print(f"length of the dataframe : {len(name_by_movie_df)} -> {len(name_by_movie_merged_important_role)}")

length of the dataframe : 172906 -> 100988

In [9]:
# check case with tommy charcater in titanic
name_by_movie_merged_important_role[name_by_movie_merged_important_role['wiki_ID'] == 52371]

,wiki_ID,char_words,gender,order,t_stat,p_value,slope_change,nb_order,all_nan
1893,52371,Rose,F,1.0,-1.552929,0.148720,0.002796,28,False
1895,52371,Jack,M,0.0,-1.987322,0.072358,0.012744,28,False
1897,52371,Bruce,M,10.0,-2.545008,0.027236,0.001570,28,False
1898,52371,Calvert,F,12.0,0.216687,0.832419,-0.000017,28,False
1899,52371,Ismay,M,10.0,NaN,NaN,0.000000,28,False
1900,52371,Brown,F,3.0,0.000000,1.000000,0.000000,28,False
1901,52371,Bobby,M,13.0,-1.158331,0.271259,0.001117,28,False
1905,52371,Fabrizio,M,14.0,-0.994141,0.341520,0.000071,28,False
1907,52371,Lizzy,F,12.0,-3.342963,0.006559,0.000100,28,False
1909,52371,Andrews,M,6.0,-0.561223,0.585897,0.000045,28,False
1910,52371,Smith,M,8.0,-0.612611,0.552587,0.000066,28,False
1911,52371,Thomas,M,6.0,-0.782808,0.450264,0.006375,28,False
1912,52371,Ruth,F,4.0,-1.262820,0.232767,0.001224,28,False
1913,52371,Dawson,M,0.0,-1.330585,0.210250,0.012189,28,False
1919,52371,Lovett,M,7.0,NaN,NaN,0.000000,28,False
1920,52371,Molly,F,3.0,0.375483,0.714441,-0.002190,28,False
1921,52371,Lewis,M,11.0,-0.271231,0.791236,0.000181,28,False
1922,52371,Buell,M,13.0,NaN,NaN,0.000000,28,False
1925,52371,Brock,M,7.0,-0.215546,0.833286,0.000392,28,False

In [10]:
# set this dataframe as name_by_movie_df
name_by_movie_df = name_by_movie_merged_important_role.copy(deep=True)
print(f"Length of the name_by_movie_df : {len(name_by_movie_df)}")
print(f"Is the indexing of name_by_movie_web unique? {name_by_movie_df.index.is_unique}")

Length of the name_by_movie_df : 100988
Is the indexing of name_by_movie_web unique? True

### Preprocessing `name_by_movie`
In this section, we remove useless columns and NaN values, add the movie release year for each character and set the name in lowercase.

In [11]:
# Remove useless 't_stat' column
name_by_movie_web = name_by_movie_df.reset_index().copy(deep=True)
name_by_movie_web.drop(columns=['index', 't_stat', 'order', 'nb_order'], inplace=True)
display(name_by_movie_web.sample(2))

       wiki_ID char_words gender   p_value  slope_change  all_nan
43493  5971762  Dominique      F  0.161204      0.005991    False
43514  5979988       Zeno      M  0.821769      0.000013    False

In [12]:
# drop gender column
len_before = len(name_by_movie_web)

name_by_movie_web.reset_index(inplace=True, drop=True)
name_by_movie_web.drop_duplicates(subset=['wiki_ID', 'char_words'], keep='first', inplace=True)
name_by_movie_web.drop(columns=['gender'], inplace=True)
name_by_movie_web.set_index(['char_words', 'wiki_ID'], inplace=True)

len_after = len(name_by_movie_web)
print(f"length of the dataframe : {len_before} -> {len_after}")
print(f"Is the indexing of name_by_movie_web unique? {name_by_movie_web.index.is_unique}")
display(name_by_movie_web.sample(2))

length of the dataframe : 100988 -> 97615
Is the indexing of name_by_movie_web unique? True

                      p_value  slope_change  all_nan
char_words wiki_ID
Powell     20831047  0.928771      0.000010    False
Thompson   2970596   0.860346      0.000028    False

In [13]:
# drop rows with NaN values in 'p_value' column
len_before = len(name_by_movie_web)
name_by_movie_web.dropna(subset=['p_value'], inplace=True)
len_after = len(name_by_movie_web)
print(f"length : {len_before} -> {len_after}")

length : 97615 -> 86657

In [14]:
# Add needed info about movie for deducing the TOP/BOTTOM/INSIGN movies
needed_movie_info = movie_df.reset_index()[['wiki_ID', 'year', 'averageRating', 'numVotes']].copy(deep=True)

len_before_merge = len(name_by_movie_web)
name_by_movie_with_info = name_by_movie_web.reset_index().merge(needed_movie_info, on='wiki_ID', how='left').copy(deep=True) # merge the release year into the name_by_movie_web dataframe
len_after_merge = len(name_by_movie_with_info)
print(f"length : {len_before_merge} -> {len_after_merge}")

name_by_movie_with_info.set_index(['char_words', 'wiki_ID'], inplace=True)
display(name_by_movie_with_info.sample(2))

length : 86657 -> 86657

,,p_value,slope_change,all_nan,year,averageRating,numVotes
char_words,wiki_ID,,,,,,
Nikhil,1324910,0.650113,-0.000133,False,2004,5.2,2010
Hope,9197200,0.217418,-0.003034,False,2006,6.1,438

In [15]:
# set the char_words in lowercase
name_by_movie_with_info.reset_index(inplace=True)
name_by_movie_with_info['char_words'] = name_by_movie_with_info['char_words'].str.lower()
name_by_movie_with_info.set_index(['char_words', 'wiki_ID'], inplace=True)
print(f"Length of name_by_movie_with_info : {len(name_by_movie_with_info)}")
display(name_by_movie_with_info.sample(2))

Length of name_by_movie_with_info : 86657

,,p_value,slope_change,all_nan,year,averageRating,numVotes
char_words,wiki_ID,,,,,,
oz,20122638,0.759452,-0.000024,False,2010,6.4,5766
clark,3831834,0.241020,-0.000525,False,1990,6.5,21582

In [16]:
# create the movie_impact dataframe
columns = ['name', 'status', 'group_year', 'movie_id']
movie_impact_df = pd.DataFrame(columns=columns)
display(movie_impact_df)

Empty DataFrame
Columns: [name, status, group_year, movie_id]
Index: []

### Three functions to compute TOP/BOTTOM/INSIGN
These three functions are used to compute the `movie_impact_df`

In [17]:
def compute_top_movies(name, chosen_name_movies_top_df, chosen_name_movies_df, movie_impact_df):
    for i in range(5): # from top1 to top5
        if(not chosen_name_movies_top_df.empty):
            # get the year with the highest positive variation
            top_i_year = chosen_name_movies_top_df.iloc[-1].year.astype(int)

            # get the movies released close to the year with the highest positive variation [top_i_year-3, top_i_year+3]
            top_i_year_chosen_name_movies = chosen_name_movies_df.query(f'year >= {top_i_year - 3} and year <= {top_i_year + 3}').copy(deep=True)

            # keep only the three most popular movies
            top_i_year_chosen_name_movies.sort_values(by=['numVotes'], ascending=False, inplace=True)
            top_i_3_chosen_name_movies = top_i_year_chosen_name_movies.iloc[:3].copy(deep=True)

            # add the the three popular movies to the movie_impact_df
            for index, row in top_i_3_chosen_name_movies.iterrows():
                movie_impact_df.loc[len(movie_impact_df)] = {'name': name, 'status': 't', 'group_year': top_i_year, 'movie_id': index}

            # remove also the movies release in the frame [-5 years, +5 years] of the top1_year
            chosen_name_movies_top_df.query(f'year < {top_i_year - 5} or year > {top_i_year + 5}', inplace=True)

            # remove the found movies from the chosen_name_movies_df to avoid picking them again for next iterations
            chosen_name_movies_df.drop(top_i_3_chosen_name_movies.index, inplace=True)

In [18]:
def compute_bottom_movies(name, chosen_name_movies_bottom_df, chosen_name_movies_df, movie_impact_df):
    for i in range(5): # from bottom1 to bottom5
        if(not chosen_name_movies_bottom_df.empty):
            # get the year with the highest negative variation
            bottom_i_year = chosen_name_movies_bottom_df.iloc[-1].year.astype(int)

            # get the movies released close to the year with the highest negative variation [bottom_i_year-3, bottom_i_year+3]
            bottom_i_year_chosen_name_movies = chosen_name_movies_df.query(f'year >= {bottom_i_year - 3} and year <= {bottom_i_year + 3}').copy(deep=True)

            # keep only the three most popular movies
            bottom_i_year_chosen_name_movies.sort_values(by=['numVotes'], ascending=False, inplace=True)
            bottom_i_3_chosen_name_movies = bottom_i_year_chosen_name_movies.iloc[:3].copy(deep=True)

            # add the the three popular movies to the movie_impact_df
            for index, row in bottom_i_3_chosen_name_movies.iterrows():
                movie_impact_df.loc[len(movie_impact_df)] = {'name': name, 'status': 'b', 'group_year': bottom_i_year, 'movie_id': index}

            # remove also the movies release in the frame [-5 years, +5 years] of the bottom_i_year
            chosen_name_movies_bottom_df.query(f'year < {bottom_i_year - 5} or year > {bottom_i_year + 5}', inplace=True)

            # remove the found movies from the chosen_name_movies_df to avoid picking them again for next iterations
            chosen_name_movies_df.drop(bottom_i_3_chosen_name_movies.index, inplace=True)

In [19]:
def compute_insign_movies(name, chosen_name_movies_insign_df, movie_impact_df):
    for i in range(5): # from insign1 to insign5
        if(not chosen_name_movies_insign_df.empty):
            # get the movies release the year with the highest rating and number of votes
            insign_i_year = chosen_name_movies_insign_df.iloc[-1].year.astype(int)
            insign_i_year_chosen_name_movies = chosen_name_movies_insign_df.query(f'year == {insign_i_year}').copy(deep=True)

            # add the most popular movie to the movie_impact_df
            movie_impact_df.loc[len(movie_impact_df)] = {'name': name, 'status': 'i', 'group_year': insign_i_year, 'movie_id': insign_i_year_chosen_name_movies.index[0]}

            # remove the found movies from the chosen_name_movies_top_df to avoid picking them again for next iterations
            chosen_name_movies_insign_df.drop(insign_i_year_chosen_name_movies.index, inplace=True)

### (Optional) Special case for a single name

In [20]:
# given name by user
chosen_name = 'elizabeth'

In [21]:
# get the movie containing the chosen name
chosen_name_movies_df = name_by_movie_with_info.loc[chosen_name, :].copy(deep=True)
display(chosen_name_movies_df)

           p_value  slope_change  all_nan  year  averageRating  numVotes
wiki_ID
44366     0.839461      0.001306    False  2000            6.7     35871
45126     0.502248     -0.007198    False  1969            7.4      7973
57820     0.719843     -0.002252    False  2001            8.0    833937
62592     0.988123      0.000095    False  1940            7.9     72466
73375     0.016718      0.018199    False  1935            7.8     51978
...            ...           ...      ...   ...            ...       ...
34194778  0.949114      0.000425    False  1939            6.4       348
34377191  0.085567      0.011863    False  2012            6.9    116791
35610105  0.085567      0.011863    False  2012            5.9     12242
35641836  0.085567      0.011863    False  2012            6.0     14921
36291706  0.740887      0.003483    False  1994            5.4      2121

[180 rows x 6 columns]

In [22]:
# sort by slope_change to have the movies ranked by how big the variation is in the movie release year
chosen_name_movies_df.sort_values(by=['slope_change'], inplace=True)

# keep only the candidate movies for the TOP 5 movies with positive impact
chosen_name_movies_top_df = chosen_name_movies_df.query('(slope_change > 0) and (p_value < 0.1)').copy(deep=True)
display(chosen_name_movies_top_df)

           p_value  slope_change  all_nan  year  averageRating  numVotes
wiki_ID
34377191  0.085567      0.011863    False  2012            6.9    116791
25129766  0.085567      0.011863    False  2012            6.2    276685
31775043  0.085567      0.011863    False  2012            7.0    631028
31960682  0.085567      0.011863    False  2012            7.1    182886
30265620  0.085567      0.011863    False  2012            7.9    536962
35610105  0.085567      0.011863    False  2012            5.9     12242
35641836  0.085567      0.011863    False  2012            6.0     14921
15280057  0.073254      0.012947    False  1949            6.6      2129
14001162  0.073254      0.012947    False  1949            6.4       477
183744    0.019626      0.014870    False  1946            7.2      1237
600132    0.010639      0.015519    False  1936            6.3      2751
24452041  0.016718      0.018199    False  1935            5.3       113
9016038   0.016718      0.018199    False  1935            6.8      2059
73375     0.016718      0.018199    False  1935            7.8     51978
18537242  0.077864      0.020117    False  1972            6.2      1253
4744688   0.031780      0.033785    False  1973            7.2      1890
1358544   0.021918      0.035355    False  1976            6.7     11312
3048950   0.021918      0.035355    False  1976            6.3      6339
4173939   0.021434      0.035991    False  1974            6.9      2541
7146876   0.021434      0.035991    False  1974            6.2      4435

In [23]:
# compute TOP 5 and add it to the movie_impact_df
compute_top_movies(chosen_name, chosen_name_movies_top_df, chosen_name_movies_df, movie_impact_df)
display(movie_impact_df)

         name status  group_year  movie_id
0   elizabeth      t        1974   1358544
1   elizabeth      t        1974   3048950
2   elizabeth      t        1974    223904
3   elizabeth      t        1935     73376
4   elizabeth      t        1935     73375
5   elizabeth      t        1935    600132
6   elizabeth      t        1946   2279601
7   elizabeth      t        1946   7590753
8   elizabeth      t        1946  15280057
9   elizabeth      t        2012  25080984
10  elizabeth      t        2012  31775043
11  elizabeth      t        2012  30265620

In [24]:
# keep only the candidate movies for the BOTTOM 5 movies with negative impact
chosen_name_movies_bottom_df = chosen_name_movies_df.query('(slope_change <= 0) and (p_value < 0.1)').copy(deep=True)
# sort by slope_change in the opposite direction to have the highest negative variation at the end
chosen_name_movies_bottom_df.sort_values(by=['slope_change'], ascending=True, inplace=True)
display(chosen_name_movies_bottom_df)

           p_value  slope_change  all_nan  year  averageRating  numVotes
wiki_ID
1709616   0.010131     -0.059634     True  1910            6.4      4596
29836834  0.021689     -0.034561    False  1982            4.7       311
23924255  0.027030     -0.034334    False  1983            5.0       936
10821674  0.074134     -0.029620     True  1984            6.3      2244
15752401  0.080510     -0.026071    False  1912            4.6       152
11770563  0.011267     -0.024274    False  1967            5.8      1580
1096485   0.011267     -0.024274    False  1967            6.4      2375

In [25]:
# compute BOTTOM 5 and add it to the movie_impact_df
compute_bottom_movies(chosen_name, chosen_name_movies_bottom_df, chosen_name_movies_df, movie_impact_df)
display(movie_impact_df)

         name status  group_year  movie_id
0   elizabeth      t        1974   1358544
1   elizabeth      t        1974   3048950
2   elizabeth      t        1974    223904
3   elizabeth      t        1935     73376
4   elizabeth      t        1935     73375
5   elizabeth      t        1935    600132
6   elizabeth      t        1946   2279601
7   elizabeth      t        1946   7590753
8   elizabeth      t        1946  15280057
9   elizabeth      t        2012  25080984
10  elizabeth      t        2012  31775043
11  elizabeth      t        2012  30265620
12  elizabeth      b        1967     45126
13  elizabeth      b        1967   1096485
14  elizabeth      b        1967   4385591
15  elizabeth      b        1912   1709616
16  elizabeth      b        1912  15752401
17  elizabeth      b        1984   1896864
18  elizabeth      b        1984    967721
19  elizabeth      b        1984  10821674

In [26]:
# keep only the candidate movies for the top 5 most famous movies with no significant impact
chosen_name_movies_insign_df = chosen_name_movies_df.query('p_value > 0.1').copy(deep=True)

# rank them by popularity
chosen_name_movies_insign_df.sort_values(by=['averageRating', 'numVotes'], inplace=True)
display(chosen_name_movies_insign_df)

           p_value  slope_change  all_nan  year  averageRating  numVotes
wiki_ID
32393429  0.265850      0.007394    False  2010            2.8       406
7473588   0.675362      0.002837    False  2006            3.0       538
6393328   0.215221     -0.016166    False  1989            3.4       566
2918858   0.865804     -0.001095    False  2005            3.7     38767
600820    0.361306     -0.010645    False  1988            3.8     16313
...            ...           ...      ...   ...            ...       ...
57820     0.719843     -0.002252    False  2001            8.0    833937
381810    0.719843     -0.002252    False  2001            8.1    118584
29454281  0.150199      0.009833    False  2011            8.1    481920
321496    0.639223     -0.002984    False  2003            8.1   1180659
3213691   0.949944     -0.000341    False  2007            8.2    623350

[144 rows x 6 columns]

In [27]:
# compute INSIGN 5 and add it to the movie_impact_df
compute_insign_movies(chosen_name, chosen_name_movies_insign_df, movie_impact_df)
display(movie_impact_df)

         name status  group_year  movie_id
0   elizabeth      t        1974   1358544
1   elizabeth      t        1974   3048950
2   elizabeth      t        1974    223904
3   elizabeth      t        1935     73376
4   elizabeth      t        1935     73375
5   elizabeth      t        1935    600132
6   elizabeth      t        1946   2279601
7   elizabeth      t        1946   7590753
8   elizabeth      t        1946  15280057
9   elizabeth      t        2012  25080984
10  elizabeth      t        2012  31775043
11  elizabeth      t        2012  30265620
12  elizabeth      b        1967     45126
13  elizabeth      b        1967   1096485
14  elizabeth      b        1967   4385591
15  elizabeth      b        1912   1709616
16  elizabeth      b        1912  15752401
17  elizabeth      b        1984   1896864
18  elizabeth      b        1984    967721
19  elizabeth      b        1984  10821674
20  elizabeth      i        2007   8775362
21  elizabeth      i        2003   2649312
22  elizabeth      i        2011  31176974
23  elizabeth      i        2001   2153973
24  elizabeth      i        1940   4829230

In [28]:
# check if there movie duplicates in the movie_impact_df
print(f"number of duplicates in movie_impact_df : {movie_impact_df.duplicated(subset=['movie_id']).sum()}")

number of duplicates in movie_impact_df : 0

### Generalize for all the names to generate `movie_impact_df`

In [29]:
# get all the names in the name_by_movie_with_info dataframe
names = name_by_movie_with_info.index.get_level_values(0).unique().tolist()
print(f"Number of names : {len(names)}")

Number of names : 8913

In [30]:
iter = 0
for name in names:
    print(f"Number of name treated: {iter}", end='\r', flush=True)
    # get the movie containing the chosen name
    chosen_name_movies_df = name_by_movie_with_info.loc[name, :].copy(deep=True)

    # sort the movies by slope_change, get movies with significant p_value and positive slope_change and compute the top 5
    chosen_name_movies_df.sort_values(by=['slope_change'], inplace=True)
    chosen_name_movies_top_df = chosen_name_movies_df.query('(slope_change > 0) and (p_value < 0.1)').copy(deep=True)
    compute_top_movies(name, chosen_name_movies_top_df, chosen_name_movies_df, movie_impact_df)

    # sort the movies by slope_change, get movies with significant p_value and negative slope_change and compute the bottom 5
    chosen_name_movies_bottom_df = chosen_name_movies_df.query('(slope_change <= 0) and (p_value < 0.1)').copy(deep=True)
    chosen_name_movies_bottom_df.sort_values(by=['slope_change'], ascending=False, inplace=True)
    compute_bottom_movies(name, chosen_name_movies_bottom_df, chosen_name_movies_df, movie_impact_df)

    # get the remaining movies and filter to keep only the insignificant ones and compute the insign 5
    chosen_name_movies_insign_df = chosen_name_movies_df.query('p_value > 0.1').copy(deep=True)
    chosen_name_movies_insign_df.sort_values(by=['numVotes'], inplace=True)
    compute_insign_movies(name, chosen_name_movies_insign_df, movie_impact_df)
    
    iter = iter + 1

In [31]:
# see the result
display(movie_impact_df.sample(10))

           name status  group_year  movie_id
32341     janek      i        2012  31775043
31580   santina      i        1965  23666602
14099       mai      i        1998    180785
11471      drew      i        2000    837494
2848       sara      t        2012  15739815
3386   franklin      t        1960    193868
7619     jeremy      t        2006   4758386
2589     mickey      b        1932   8843714
23382      crue      i        1996   1528430
29648     rajni      i        2000  11539531

### (Optional) Import `movie_impact` dataframe to avoid timeconsuming computation

In [32]:
# import the movie_impact_df to avoid the time-consuming computation of movie_impact_df
imported_movie_impact_df = pd.read_csv(os.path.join(processed_website_data_folder, 'movie_impacts.csv'))
imported_movie_impact_df.set_index(['name', 'status'], inplace=True)
display(imported_movie_impact_df)

                  index  group_year  movie_id
name      status
elizabeth t           0        1974   1358544
          t           1        1974   3048950
          t           2        1974    223904
          t           3        1935     73376
          t           4        1935     73375
...                 ...         ...       ...
calisto   i       32573        2011  36404162
licia     i       32574        2012  36424869
zelma     i       32575        1939  36598217
kirstie   i       32576        2007  36956792
carlina   i       32577        2012  37196243

[32578 rows x 3 columns]

In [33]:
# Check for NaN values in the name column
contains_nan = imported_movie_impact_df.reset_index()['name'].isna().any()

if contains_nan:
    print("The `name` column contains NaN values.")
else:
    print("The `name` column does not contain NaN values.")

The `name` column contains NaN values.

For some reason, the name column contains NaN values. Let's remove them.

In [34]:
# drop NaN values in the name column
print(f"Length of imported_movie_impact_df before dropping NaN values : {len(imported_movie_impact_df)}")
imported_movie_impact_df.reset_index(inplace=True)
imported_movie_impact_df.dropna(subset=['name'], inplace=True)
imported_movie_impact_df.set_index(['name', 'status'], inplace=True)
print(f"Length of imported_movie_impact_df after dropping NaN values : {len(imported_movie_impact_df)}")

display(imported_movie_impact_df)

# uncomment the next line to save the imported dataframe as movie_impact_df
# movie_impact_df = imported_movie_impact_df.copy(deep=True)

Length of imported_movie_impact_df before dropping NaN values : 32578
Length of imported_movie_impact_df after dropping NaN values : 32573

                  index  group_year  movie_id
name      status
elizabeth t           0        1974   1358544
          t           1        1974   3048950
          t           2        1974    223904
          t           3        1935     73376
          t           4        1935     73375
...                 ...         ...       ...
calisto   i       32573        2011  36404162
licia     i       32574        2012  36424869
zelma     i       32575        1939  36598217
kirstie   i       32576        2007  36956792
carlina   i       32577        2012  37196243

[32573 rows x 3 columns]

In [35]:
# Check for NaN values in the name column
contains_nan = imported_movie_impact_df.reset_index()['name'].isna().any()

if contains_nan:
    print("The `name` column contains NaN values.")
else:
    print("The `name` column does not contain NaN values.")

The `name` column does not contain NaN values.

## Compute `name_per_year` dataframe

The dataframe `name_per_year` is a subset of the dataframe `name_by_movie` computed in [preprocessing.ipynb](./preprocessing.ipynb).

In [36]:
# remove number column
name_per_year = baby_name_df.copy(deep=True)
name_per_year.drop(columns='number', inplace=True)
display(name_per_year.sample(2))
print(f"Is the indexing of name_per_year unique? {name_per_year.index.is_unique}")
print(f"Length of the name_per_year_df : {len(name_per_year)}")

             percentage
name   year
Blair  1904    0.000768
Leiani 2007    0.000078

Is the indexing of name_per_year unique? True
Length of the name_per_year_df : 1903290

In [37]:
# round the percentage values to reduce the size of the future csv file for the web
name_per_year['percentage'] = name_per_year['percentage'].round(6)

# set the names in lowercases
name_per_year.reset_index(inplace=True)
name_per_year['name'] = name_per_year['name'].str.lower()
name_per_year.set_index(['name', 'year'], inplace=True)

display(name_per_year.sample(2))
print(f"Length of the name_per_year_df : {len(name_per_year)}")

              percentage
name    year
desean  1975    0.000676
londynn 2010    0.003644

Length of the name_per_year_df : 1903290

In [38]:
# filter the name_per_year_df to keep only the names in the movie_impact_df
name_per_year_filtered = name_per_year.loc[movie_impact_df.reset_index()['name'].unique().tolist(), :].copy(deep=True)
name_per_year = name_per_year_filtered.copy(deep=True)

In [39]:
# Let's sort the dataframe name_per_year to anticipate the ploting
name_per_year.sort_values(by=['name', 'year'], inplace=True)
display(name_per_year.head(15))

            percentage
name  year
aadam 1987    0.000028
      1988    0.000028
      1993    0.000082
      1994    0.000055
      1995    0.000056
      1996    0.000028
      1997    0.000028
      1998    0.000112
      1999    0.000028
      2000    0.000055
      2002    0.000193
      2003    0.000163
      2004    0.000135
      2005    0.000054
      2006    0.000131

Compute the number of names in the three dataframes in order to compare

In [40]:
# compute how many unique names are there in the dataframes to compare
names_in_name_per_year = name_per_year.reset_index()['name'].unique().tolist()
print(f"Number of unique names in name_per_year = {len(names_in_name_per_year)}")
names_in_movie_impact = movie_impact_df.reset_index()['name'].unique().tolist()
print(f"Number of unique names in movie_impact_df = {len(names_in_movie_impact)}")
names_in_name_by_movie_with_info = name_by_movie_with_info.reset_index()['char_words'].unique().tolist()
print(f"Number of unique names in name_by_movie_with_info = {len(names_in_name_by_movie_with_info)}")

Number of unique names in name_per_year = 8913
Number of unique names in movie_impact_df = 8913
Number of unique names in name_by_movie_with_info = 8913

In [41]:
# Identify names in name_by_movie not present in name_per_year
values_only_in_name_by_movie = name_by_movie_with_info.reset_index()[~name_by_movie_with_info.reset_index()['char_words'].isin(name_per_year.reset_index()['name'])]['char_words'].unique()

print(f"Number of unique names in name_by_movie_with_info  = {len(name_by_movie_with_info.reset_index()['char_words'].unique())}")

# Display the result
print("Values in name_by_movie_with_info but not present in name_per_year:")
print(values_only_in_name_by_movie)
print(f"Number of names missing  = {len(values_only_in_name_by_movie)}")

Number of unique names in name_by_movie_with_info  = 8913
Values in name_by_movie_with_info but not present in name_per_year:
[]
Number of names missing  = 0

All good :)

## Compute `movies` dataframe
This dataset contains the information relative to the movie given its `wiki_ID`. It is a subset of the dataframe `movie_df` computed in [preprocessing.ipynb](./preprocessing.ipynb).

In [42]:
# keep only the movies in the movie_df that are in the movie_impact_df
simplified_movie_df = movie_df.loc[movie_impact_df['movie_id'].unique().tolist(), :].copy(deep=True)

print(f"Number of movies in movie_impact_df : {len(movie_impact_df['movie_id'].unique())}")
print(f"Number of movies kept in movie_df: {len(simplified_movie_df)}")

# remove useless columns
simplified_movie_df.drop(columns=['month', 'revenue'], inplace=True)
simplified_movie_df.rename(columns={'averageRating': 'rating', 'numVotes': 'votes', 'IMDB_ID': 'imdb_id'}, inplace=True)

display(simplified_movie_df.sample(2))

Number of movies in movie_impact_df : 14774
Number of movies kept in movie_df: 14774

,mov_name,year,votes,rating,poster_url,imdb_id
wiki_ID,,,,,,
25632517,Love on Toast,1937,55,6.3,/Qb2ufYei9ryAuqQmRP2KQOunkf.jpg,tt0030389
2138030,Dev,2004,1464,6.7,/hZrDic5d9lpPKY5SQrZcGfhsrq4.jpg,tt0364303

## Export the three datasets

In [44]:
# Export movie_impact.csv
display(movie_impact_df.reset_index().sample(2))
movie_impact_df.to_csv(os.path.join(processed_website_data_folder, 'movie_impacts.csv'), index=False)

# Export name_per_year.csv
display(name_per_year.reset_index().sample(2))
name_per_year.to_csv(os.path.join(processed_website_data_folder, 'name_per_year.csv'), index=True)

# Export movie.csv
display(simplified_movie_df.reset_index().sample(2))
simplified_movie_df.to_csv(os.path.join(processed_website_data_folder, 'movies.csv'), index=True)

       index       name status  group_year  movie_id
19774  19774  priscilla      t        2011  34480764
12188  12188      karin      i        1991  23941298

           name  year  percentage
536352  tierney  2013    0.001477
63954   blakely  1963    0.000077

,wiki_ID,mov_name,year,votes,rating,poster_url,imdb_id
14113,17344938,120,2008,6984,7.2,/qfuusVNYVYyKQcmr0LGS7zsAUxT.jpg,tt1166085
12363,11056402,Killed the Family and Went to the Movie Theater,1991,289,5.1,/wydyTyXRpydovxwcukQYarJHKcW.jpg,tt0241708